In [1]:
%load_ext sql
%reload_ext sql
%sql sqlite://

In [2]:
%%sql
create table Table1(first_name varchar(20),last_name varchar(20))

 * sqlite://
Done.

[]

In [3]:
%%sql 
insert into table1 values("venky",'sanu');
insert into table1 values("nag",'bam');
insert into table1 values("ram",'sunny');
insert into table1 values("babu",'dadi');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [4]:
%%sql
create table Table2(first_name varchar(20),last_name varchar(20))

 * sqlite://
Done.

[]

In [5]:
%%sql 
insert into table2 values("venky",'sanu');
insert into table2 values("narayana",'dam');
insert into table2 values("sam",'singer');
insert into table2 values("babu",'dadi');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

#### Q-15. Write an SQL query to fetch intersecting records of two tables.

In [7]:
%%sql
select * from table1 intersect select * from table2

 * sqlite://
Done.

[('babu', 'dadi'), ('venky', 'sanu')]

#### Q-16. Write an SQL query to show records from one table that another table does not have.

In [8]:
%%sql
select * from table1 except select * from table2

 * sqlite://
Done.

[('nag', 'bam'), ('ram', 'sunny')]